RL-overview.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-09 Mon 16:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Sam Partee" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd31fe3c">1. Reinforcement Learning: Past, Present, and future Prospectives</a>
<ul>
<li><a href="#org75af0cf">1.1. Key RL Challenges</a></li>
<li><a href="#orge37c7aa">1.2. Background</a></li>
<li><a href="#orgaf71b51">1.3. Exploration vs Exploitation - Common Approaches</a></li>
<li><a href="#orgf93e867">1.4. Boostrapped DQN - Osband et al 2016</a></li>
<li><a href="#org2445410">1.5. Actor - Critic</a></li>
<li><a href="#org14c9f3f">1.6. Generalization in ML</a></li>
<li><a href="#orgd90a012">1.7. Meta-learning</a></li>
<li><a href="#org28e58fb">1.8. Models</a>
<ul>
<li><a href="#orgede50b2">1.8.1. learning from data?</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc0124a7">2. Papers</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd31fe3c" class="outline-2">
<h2 id="orgd31fe3c"><span class="section-number-2">1</span> Reinforcement Learning: Past, Present, and future Prospectives</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Katja Hofmann</li>
</ul>
</div>
<div id="outline-container-org75af0cf" class="outline-3">
<h3 id="org75af0cf"><span class="section-number-3">1.1</span> Key RL Challenges</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Explore vs Exploit</li>
<li>Credit Assignment</li>
<li>Function approximation</li>
</ul>
</div>
</div>
<div id="outline-container-orge37c7aa" class="outline-3">
<h3 id="orge37c7aa"><span class="section-number-3">1.2</span> Background</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Markov Decision Process (MDP) - Bellman (1953)
<ul class="org-ul">
<li>Agent, state, reward and environment</li>
<li>Agent doesnt know about the dynamics of the state</li>
<li>Reward is a modeling choice that enforces the agent behavior</li>
<li>Behavior Policy is a distribution of action given a state.</li>
</ul></li>
<li>Optimality in MDP
<ul class="org-ul">
<li>Finite Horizon</li>
<li>Infinite Horizon</li>
<li>Average Reward</li>
</ul></li>
<li>Recursive Bellman equations define the sequence of possible decisions. The transition
functions take the agent from state to state where each previous set of states impacts
the next transition.</li>
<li>TD-Gammon</li>
<li>Q-learning</li>
<li>DQN
<ul class="org-ul">
<li>Experience replay buffer and mini-batch SGD</li>
<li>Seperate target network stabilizes opmtimizaion targets</li>
<li>normalized error</li>
<li>able to play 49 atari games and reach superhuman results on 75% of them</li>
</ul></li>
<li>Imrpoving DQN since 2016
<ul class="org-ul">
<li>Double Q learning (Van Hasselt et al)</li>
<li>Average G learning (Anshel et al)</li>
<li>Hindsight experience replay (Andrychowicz et al)</li>
<li>Distributional RL</li>
<li>Ape x - distributed replay buffer</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgaf71b51" class="outline-3">
<h3 id="orgaf71b51"><span class="section-number-3">1.3</span> Exploration vs Exploitation - Common Approaches</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Optimistic initialization</li>
<li>Epsilion greedy</li>
<li>Softmax Policy
<ul class="org-ul">
<li>actions are sampled on their probability of being optimal</li>
</ul></li>
<li>Upper Confidence Bound</li>
<li>Posterior Sampling
<ul class="org-ul">
<li>agent maintains a distribution</li>
<li>useful in bandit settings</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgf93e867" class="outline-3">
<h3 id="orgf93e867"><span class="section-number-3">1.4</span> Boostrapped DQN - Osband et al 2016</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Approximate uncertainty over Q using deep ensembles</li>
<li>extended in 2018 with randomized prior function (Osband el al, 2018)</li>
</ul>
</div>
</div>

<div id="outline-container-org2445410" class="outline-3">
<h3 id="org2445410"><span class="section-number-3">1.5</span> Actor - Critic</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Conservative policy iteration (CPI) (kakade and langford 2002)</li>
<li>Trust Region Policy Optimization (TRPO) (Schulman et al 2015)</li>
<li>Proximal Policy Optimization (PPO) (Schulman et al 2017)</li>
<li>Soft Actor Critic (SAC) (Haarnoja et al 2018)</li>
<li>Optimistic Actor Critic (Hofmann et al 2019)</li>
</ul>
</div>
</div>

<div id="outline-container-org14c9f3f" class="outline-3">
<h3 id="org14c9f3f"><span class="section-number-3">1.6</span> Generalization in ML</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>How to use various tasks to show that a learning strategy has generalized</li>
<li>Mutli-room benchmark
<ul class="org-ul">
<li>Agent must learn to navigate not just based on a single room</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgd90a012" class="outline-3">
<h3 id="orgd90a012"><span class="section-number-3">1.7</span> Meta-learning</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>Model agnostic meta learning (MAML) (Finn et al 2017)</li>
</ul>
</div>
</div>

<div id="outline-container-org28e58fb" class="outline-3">
<h3 id="org28e58fb"><span class="section-number-3">1.8</span> Models</h3>
<div class="outline-text-3" id="text-1-8">
</div>
<div id="outline-container-orgede50b2" class="outline-4">
<h4 id="orgede50b2"><span class="section-number-4">1.8.1</span> learning from data?</h4>
<div class="outline-text-4" id="text-1-8-1">
<ul class="org-ul">
<li>PILCO Deisenroth &amp; Rasmussen 2011)</li>
<li>World models (David Ha and schmidhuber 2018)
<ul class="org-ul">
<li>learn models for policy optimization in visual domains</li>
</ul></li>
<li>Ensembles of Bayesian NNs (Chua et al 2018)</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc0124a7" class="outline-2">
<h2 id="orgc0124a7"><span class="section-number-2">2</span> Papers</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Kaelbling, Littman and Moore</li>
<li>Cobbe et al 2019</li>
<li>Dayan et al 1993 (successor features)</li>
<li>Chevalier-Boisvert el al 2018 (multi-room benchmark)</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Sam Partee</p>
<p class="date">Created: 2019-12-09 Mon 16:25</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
